# -*- eval: (save-excursion (org-babel-goto-named-src-block "workshopPreamble") (org-babel-execute-src-block)) -*-
#+TITLE:     Einführung in DevOps
#+AUTHOR:    Jörg Reuter
#+EMAIL:     joerg@reuter.sc
#+DATE:      12.12.2016

#+PROPERTY: exports both
#+EXCLUDE_TAGS: noexport mitsetup
#+SETUPFILE: ../workshopPreamble.org

#+name: workshopPreamble
#+begin_src emacs-lisp :exports none :results silent :tangle no
  (load-file "../setupEnvironment.el")
#+end_src

* Zum eigenen Image
Mit dem Befehl
#+name: dockerinfo
#+begin_src bash :export both
  docker info
#+end_src

#+RESULTS:
#+begin_example
Containers: 0
 Running: 0
 Paused: 0
 Stopped: 0
Images: 0
Server Version: 1.10.3
Storage Driver: overlay
 Backing Filesystem: extfs
Execution Driver: native-0.2
Logging Driver: json-file
Plugins:
 Volume: local
 Network: null host bridge
Kernel Version: 4.7.0-coreos
Operating System: CoreOS 1122.2.0 (MoreOS)
OSType: linux
Architecture: x86_64
CPUs: 1
Total Memory: 493.2 MiB
Name: fbs-01
ID: UEJT:QG6A:VS7A:HUWD:6J6D:PPVX:C5DY:XS5R:GHQ7:2RWT:7PLT:DDE5
#+end_example
überprüfen wir, ob Docker installiert ist und ordnungsgemäß läuft.
Um ein neues Image zu erstellen, gibt es zwei Wege:

- docker commit
- docker build

Die mächtigste und übliche Methode ist der Weg über den Befehl docker build.

Beachte: Wir bauen keine komplett neuen Images. Der Weg ist vielmehr, dass wir ein bestehendes Image (z.B. Ubuntu) entsprechend anpassen!

** Login
Wir melden uns jetzt von der Konsole aus bei Docker Hub an:

#+name: dockerinfo
#+begin_src bash :export both
  docker login
#+end_src

#+RESULTS:
#+begin_example
Username: joergre
Password:
Email: joerg@reuter.sc
WARNING: login credentials saved in /home/core/.docker/config.json
Login Succeeded
#+end_example

Mit dem Befehl
#+name: dockerinfo
#+begin_src bash :export both
  docker logout
#+end_src

#+RESULTS:
#+begin_example
Remove login credentials for https://index.docker.io/v1/
#+end_example

melden wir uns von Docker ab. Aber wir melden uns sofort wieder an, wir möchte ja mit Docker Hub arbeiten.

** Docker commit
Wie bereits erwähnt, der eher unübliche Weg. Das Kapitel dient nur dazu, zu zeigen, wie man es auch machen kann.

Wir fangen immer mit einem bestehenden Image an. Bei Docker commit starten wir das Image und erstellen so einen Container:
#+name: dockerinfo
#+begin_src bash :export both
  docker run -i -t ubuntu /bin/bash
#+end_src

#+RESULTS:
#+begin_example
Unable to find image 'ubuntu:latest' locally
latest: Pulling from library/ubuntu

cad964aed91d: Pull complete
3a80a22fea63: Pull complete
50de990d7957: Pull complete
61e032b8f2cb: Pull complete
9f03ce1741bf: Pull complete
Digest: sha256:28d4c5234db8d5a634d5e621c363d900f8f241240ee0a6a978784c978fe9c737
Status: Downloaded newer image for ubuntu:latest
root@f39032b9f532:/#
#+end_example

Den Befehl haben wir ja bereits öfters ausgeführt. Insofern sind wir (hoffentlich) nicht überrascht, dass wir in dem Container angemeldet sind.
Als nächste Schritt installieren wir den Webserver Apache. Zuerst müssen wir dazu das Repository der Packete aktualisieren:

#+name: dockerinfo
#+begin_src bash :export both
  apt -yqq update
#+end_src

#+RESULTS:
#+begin_example
6 packages can be upgraded. Run 'apt list --upgradable' to see them.
#+end_example

Wir könnten jetzt ein apt upgrade ausführen, dass lassen wir aber und fahren fort mit der Installation:

#+name: dockerinfo
#+begin_src bash :export both
  apt -yqq install apache2
#+end_src

Die Ausgabe erspare ich mir an dieser Stelle. Wir möchten nun den Zustand des Containers sichern um ihn später weiterverwenden zu können. Wir loggen uns mit exit aus:
#+begin_src bash :export both
  exit
#+end_src

#+RESULTS:
#+begin_example
exit
core@fbs-01 ~ $
#+end_example

*** Aufgabe
Finde heraus, welche Bedeutung die Parameter -yqq bei dem Installationsprozess haben.

Unser Container ist jetzt beendet. Wir suchen uns jetzt die Container-ID:
#+begin_src bash :export both
  docker ps
#+end_src

#+RESULTS:
#+begin_example
CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS                     PORTS               NAMES
f39032b9f532        ubuntu              "/bin/bash"         13 minutes ago      Exited (0) 3 minutes ago                       pensive_stallman
#+end_example

und führen jetzt einen docker commit durch:

#+begin_src bash :export both
  docker commit f39032b9f532 joergre/apache2
#+end_src

#+RESULTS:
#+begin_example
sha256:91d4e09127ec25aa2dce9f86afa78bdb436aae6adde787142c54a99766b182ee
#+end_example

Ihr benötigt für das commit die Container-ID und (optional) Euren Benutzername von Docker HUB und durch "/" getrennt ein Imagenamen den Ihr frei wählen könnt. Sinnvoller Weise sollte der Name so gewählt werden, dass man auch nächste Woche noch eine Idee über den Inhalt des Containers hat.
Nun möchten wir uns das Ergebniss auch anschauen:

#+begin_src bash :export both
  docker images
#+end_src

#+RESULTS:
#+begin_example
REPOSITORY          TAG                 IMAGE ID            CREATED              SIZE
joergre/apache2     latest              91d4e09127ec        About a minute ago   265.2 MB
ubuntu              latest              c73a085dc378        2 weeks ago          127 MB
#+end_example

Und da sehen wir, voller stolz, unser erstes Image. Wir können dem Image jetzt noch weitere Metadaten hinzufügen, damit wir besser erkennen können, was wir hier für ein Image haben.
#+begin_src bash :export both
  docker commit -m "Mein erstes eigene Image. Das war ja einfach" -a "Jörg Reuter" f39032b9f532 joergre/apache2:webserver
#+end_src

#+RESULTS:
#+begin_example
sha256:cfca430f55847bbf5f3b54a70325adde853cf1447d1524afa104199a5addff85
#+end_example

Mit -m wurde eine Kommentar zum Container hinzugefügt, mit -a ein Autor und mit ":" ein Tag bzw. Version. Mit dem Befehl docker images sehen wir unser neues Produkt:

#+begin_src bash :export both
  docker images
#+end_src

#+RESULTS:
#+begin_example
REPOSITORY          TAG                 IMAGE ID            CREATED             SIZE
joergre/apache2     webserver           cfca430f5584        8 seconds ago       265.2 MB
joergre/apache2     latest              91d4e09127ec        20 minutes ago      265.2 MB
ubuntu              latest              c73a085dc378        2 weeks ago         127 MB
#+end_example

Mit docker inspect können wir das Image näher untersuchen:
#+begin_src bash :export both
  docker inspect joergre/apache2:webserver
#+end_src

#+RESULTS:
#+begin_example
[
    {
        "Id": "sha256:cfca430f55847bbf5f3b54a70325adde853cf1447d1524afa104199a5addff85",
        "RepoTags": [
            "joergre/apache2:webserver"
        ],
        "RepoDigests": [],
        "Parent": "sha256:c73a085dc3782b3fd4c032971c76d6afb45fa3728a048175c8c77d7403de5f21",
        "Comment": "Mein erstes eigene Image. Das war ja einfach",
        "Created": "2016-10-11T04:40:50.411198103Z",
        "Container": "f39032b9f5329f63d73f7bfc70b0fa3f5b88c29ddd98cd75ab832a629e2b113c",
        "ContainerConfig": {
            "Hostname": "f39032b9f532",
            "Domainname": "",
            "User": "",
            "AttachStdin": true,
            "AttachStdout": true,
            "AttachStderr": true,
            "Tty": true,
            "OpenStdin": true,
            "StdinOnce": true,
            "Env": [
                "PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin"
            ],
            "Cmd": [
                "/bin/bash"
            ],
            "Image": "ubuntu",
            "Volumes": null,
            "WorkingDir": "",
            "Entrypoint": null,
            "OnBuild": null,
            "Labels": {},
            "StopSignal": "SIGTERM"
        },
        "DockerVersion": "1.10.3",
        "Author": "Jörg Reuter",
        "Config": {
            "Hostname": "",
            "Domainname": "",
            "User": "",
            "AttachStdin": false,
            "AttachStdout": false,
            "AttachStderr": false,
            "Tty": false,
            "OpenStdin": false,
            "StdinOnce": false,
            "Env": [
                "PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin"
            ],
            "Cmd": [
                "/bin/bash"
            ],
            "Image": "",
            "Volumes": null,
            "WorkingDir": "",
            "Entrypoint": null,
            "OnBuild": null,
            "Labels": {}
        },
        "Architecture": "amd64",
        "Os": "linux",
        "Size": 265202837,
        "VirtualSize": 265202837,
        "GraphDriver": {
            "Name": "overlay",
            "Data": {
                "RootDir": "/var/lib/docker/overlay/9c634d9573d15e4da697c5a58bbeee4ceb677ae5a7afab6263e6c9b15b6d13f1/root"
            }
        }
    }
]
#+end_example
Eine Übersicht über alle Parameter findet Ihr hier: http://54.71.194.30:4016/reference/commandline/cli/#commit

Jetzt starten wir unser neues Image in einem Container:

#+begin_src bash :export both
  docker run -t -i joergre/apache2:webserver /bin/bash
#+end_src












## OpenStack

OpenStack besteht aus folgenden Komponenten:

- Compute           "Nova"
- Objekt Storage    "Swift"
- Block Storage     "Cinder"
- Networking        "Neutron"
- Dashboard         "Horizon"
- Identity Service  "KeyStone"
- Image Service     "Glance"

Eine graphische Übersicht gibt es hier:
